In [1]:
import seaborn as sns
import pandas as pd
import numpy as np

In [2]:
tips = sns.load_dataset('tips')
tips.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [3]:
tips.sample(5)

     total_bill   tip     sex smoker  day    time  size
11        35.26  5.00  Female     No  Sun  Dinner     4
114       25.71  4.00  Female     No  Sun  Dinner     3
216       28.15  3.00    Male    Yes  Sat  Dinner     5
104       20.92  4.08  Female     No  Sat  Dinner     2
22        15.77  2.23  Female     No  Sat  Dinner     2

In [4]:
tips.sample?

In [5]:
is_weekend = tips.day.isin(['Sat', 'Sun']).sample(5)
is_weekend

66      True
7       True
86     False
85     False
133    False
Name: day, dtype: bool

In [6]:
tips[tips.day.isin(['Sat', 'Sun'])].sample(5)

     total_bill   tip     sex smoker  day    time  size
74        14.73  2.20  Female     No  Sat  Dinner     2
29        19.65  3.00  Female     No  Sat  Dinner     2
234       15.53  3.00    Male    Yes  Sat  Dinner     2
21        20.29  2.75  Female     No  Sat  Dinner     2
27        12.69  2.00    Male     No  Sat  Dinner     2

In [7]:
tips[['time', 'day']].drop_duplicates(keep='first')

       time   day
0    Dinner   Sun
19   Dinner   Sat
77    Lunch  Thur
90   Dinner   Fri
220   Lunch   Fri
243  Dinner  Thur

In [8]:
pd.cut(tips['total_bill'], 3, labels=['low', 'mid', 'high']).head()

0    low
1    low
2    mid
3    mid
4    mid
Name: total_bill, dtype: category
Categories (3, object): ['low' < 'mid' < 'high']

In [9]:
tips.sex.str.lower().head()

0    female
1      male
2      male
3      male
4    female
Name: sex, dtype: object

In [10]:
tips.isna().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [11]:
tips.tip.fillna(0, inplace=True)

In [12]:
tips.dropna(axis=1, how='any', inplace=True)

In [13]:
tips[['tip', 'total_bill']].corr('pearson')

                 tip  total_bill
tip         1.000000    0.675734
total_bill  0.675734    1.000000

In [14]:
tips.tip.rank().head()

0      5.0
1     33.0
2    177.0
3    165.0
4    185.0
Name: tip, dtype: float64

In [15]:
tips.rename(columns={'total_bill': 'bill'}, inplace=True)

In [16]:
for tup in tips.itertuples():
    print(tup)
    break

Pandas(Index=0, bill=16.99, tip=1.01, sex='Female', smoker='No', day='Sun', time='Dinner', size=2)

In [17]:
ls

 Volume in drive C is SSD
 Volume Serial Number is 7E11-E9E6

 Directory of C:\Users\AKU\magang\cp1

09/02/2023  02:49    <DIR>          .
09/02/2023  02:49    <DIR>          ..
09/02/2023  02:47    <DIR>          .ipynb_checkpoints
09/02/2023  02:46             9.444 combining-dataframes.ipynb
09/02/2023  02:36            19.981 group-operation.ipynb
09/02/2023  02:31            17.269 index-and-selecting.ipynb
09/02/2023  02:49             8.853 misc-functions.ipynb
09/02/2023  02:41            32.434 row-column-transformations.ipynb
               5 File(s)         87.981 bytes
               3 Dir(s)  848.206.495.744 bytes free